[
    {
        "Seller": "Emma Wilson",
        "ToyName": "Turbo Racers Car",
        "Image": "https://i.ibb.co/28Ffzs7/2.jpg",
        "SubCategory": "Automobiles",
        "Price": "34.99",
        "AvailableQuantity": 3,
        "Rating": 4.5,
        "Details": "The Turbo Racers Car is a high-speed racing car designed for adrenaline junkies. It features a sleek design, powerful engine, and advanced aerodynamics for maximum performance on the track. Get ready to experience the thrill of speed with this fantastic toy car!"
    },
    {
        "Seller": "Liam Thompson",
        "ToyName": "Velocity Wheels Car",
        "Image": "https://i.ibb.co/qmYRqtM/1.jpg",
        "SubCategory": "Automobiles",
        "Price": "19.99",
        "AvailableQuantity": 6,
        "Rating": 3.8,
        "Details": "The Velocity Wheels Car is a stylish and fast toy car that will leave you amazed. It features a vibrant color scheme, sleek body design, and high-performance wheels for a smooth ride. With its affordable price and cool looks, this toy car is perfect for all car enthusiasts."
    },
    {
        "Seller": "Charlotte Davis",
        "ToyName": "MightyBuilders Construction",
        "Image": "https://i.ibb.co/31vrb53/1.jpg",
        "SubCategory": "Construction",
        "Price": "28.99",
        "AvailableQuantity": 2,
        "Rating": 4.2,
        "Details": "Unleash your creativity with the MightyBuilders Construction set. This amazing toy allows you to build and create various structures using durable and colorful building blocks. Whether you want to construct buildings, bridges, or anything you can imagine, this set will provide endless fun and learning opportunities."
    },
    {
        "Seller": "Oliver Johnson",
        "ToyName": "Build-o-Matic Construction",
        "Image": "https://i.ibb.co/3yGpfTY/2.jpg",
        "SubCategory": "Construction",
        "Price": "45.99",
        "AvailableQuantity": 1,
        "Rating": 4.7,
        "Details": "Build big and build bold with the Build-o-Matic Construction set. This comprehensive set includes a wide range of building components, such as beams, connectors, and panels, allowing you to create impressive structures. With its high-quality materials and versatile design, this construction set is perfect for aspiring builders."
    },
    {
        "Seller": "Ava Smith",
        "ToyName": "Mega Construction Maker",
        "Image": "https://i.ibb.co/VYKThLC/3.jpg",
        "SubCategory": "Construction",
        "Price": "9.99",
        "AvailableQuantity": 10,
        "Rating": 3.5,
        "Details": "Unleash your imagination with the Mega Construction Maker. This set includes a variety of colorful blocks and connectors that can be easily assembled to create unique structures. From houses and towers to vehicles and animals, the possibilities are endless. Let your creativity run wild with this fantastic construction toy!"
    },
    {
        "Seller": "Mia Johnson",
        "ToyName": "Yellow Giant",
        "Image": "https://i.ibb.co/FnCK9bV/5.jpg",
        "SubCategory": "Construction",
        "Price": "12.99",
        "AvailableQuantity": 8,
        "Rating": 4.1,
        "Details": "Go big with the Yellow Giant construction toy. This set features large, easy-to-handle blocks in vibrant yellow color. Build tall towers, sturdy structures, and impressive designs with these chunky blocks. The Yellow Giant provides endless building fun for young builders and encourages creativity and spatial skills."
    },
    {
        "Seller": "Ethan Wilson",
        "ToyName": "Bugger Beast",
        "Image": "https://i.ibb.co/jGbBZgd/4.jpg",
        "SubCategory": "Construction",
        "Price": "69.99",
        "AvailableQuantity": 3,
        "Rating": 4.8,
        "Details": "Unleash the power of imagination with the Bugger Beast construction set. This set includes a variety of unique components, such as gears, wheels, and connectors, allowing you to create moving structures and mechanical wonders. With its durable construction and limitless possibilities, the Bugger Beast is perfect for young inventors and engineers."
    },
    {
        "Seller": "Sophia Taylor",
        "ToyName": "Carletto Mini Racer",
        "Image": "https://i.ibb.co/cFvD8VM/1.jpg",
        "SubCategory": "Mini",
        "Price": "21.99",
        "AvailableQuantity": 4,
        "Rating": 4.3,
        "Details": "Experience the thrill of speed with the Carletto Mini Racer. This compact toy car features a sleek design and smooth wheels, allowing it to zip through tracks and obstacle courses with ease. Whether you're racing against friends or performing cool stunts, this mini racer guarantees hours of fun and excitement."
    },
    {
        "Seller": "William Anderson",
        "ToyName": "Mini Speedster Car",
        "Image": "https://i.ibb.co/0cP2mBB/2.jpg",
        "SubCategory": "Mini",
        "Price": "39.99",
        "AvailableQuantity": 2,
        "Rating": 3.9,
        "Details": "Get ready to race with the Mini Speedster Car. This sleek and stylish toy car is designed for maximum speed and performance. With its aerodynamic shape and powerful wheels, it's perfect for racing enthusiasts. Whether you're competing on a track or staging your own races, the Mini Speedster Car will deliver endless fun."
    },
    {
        "Seller": "Isabella Thompson",
        "ToyName": "Microcar Mini Turbo",
        "Image": "https://i.ibb.co/h8nrqdy/3.jpg",
        "SubCategory": "Mini",
        "Price": "14.99",
        "AvailableQuantity": 7,
        "Rating": 4.6,
        "Details": "Experience turbocharged fun with the Microcar Mini Turbo. This tiny toy car may be small in size but packs a punch. With its powerful engine and sleek design, it can outperform larger vehicles on the race track. Collect multiple Mini Turbos and organize thrilling races with your friends for an unforgettable experience."
    },
    {
        "Seller": "James Johnson",
        "ToyName": "Miniature Car Cruiser",
        "Image": "https://i.ibb.co/s9nTpNn/4.jpg",
        "SubCategory": "Mini",
        "Price": "24.99",
        "AvailableQuantity": 3,
        "Rating": 3.7,
        "Details": "Cruise in style with the Miniature Car Cruiser. This compact and colorful toy car is perfect for little hands. With its smooth wheels and sturdy construction, it's designed to provide endless hours of imaginative play. Take it on adventures, create your own racing tracks, and let your imagination drive you to new destinations."
    },
    {
        "Seller": "Harper Davis",
        "ToyName": "Carito Mini Roadster",
        "Image": "https://i.ibb.co/y04QtSt/5.jpg",
        "SubCategory": "Mini",
        "Price": "16.99",
        "AvailableQuantity": 5,
        "Rating": 4.0,
        "Details": "Hit the road in style with the Carito Mini Roadster. This sleek and sporty toy car is designed for speed and performance. With its aerodynamic design and precision engineering, it's perfect for racing enthusiasts. Whether you're racing against friends or going on solo adventures, the Carito Mini Roadster guarantees an exhilarating experience."
    },
    {
        "Seller": "Benjamin Wilson",
        "ToyName": "Tiny Car Mini Drifter",
        "Image": "https://i.ibb.co/Qp1B1P5/6.jpg",
        "SubCategory": "Mini",
        "Price": "9.99",
        "AvailableQuantity": 10,
        "Rating": 4.4,
        "Details": "Drift into fun with the Tiny Car Mini Drifter. This compact toy car features unique drifting wheels that allow it to slide and spin around corners. Whether you're performing drift maneuvers or practicing precision driving, the Mini Drifter provides endless entertainment. Get ready for exciting and adrenaline-fueled adventures!"
    },
    {
        "Seller": "Avery Brown",
        "ToyName": "Mini Wheels Carriage",
        "Image": "https://i.ibb.co/bz4Cp48/7.jpg",
        "SubCategory": "Mini",
        "Price": "7.99",
        "AvailableQuantity": 6,
        "Rating": 3.9,
        "Details": "Enter the magical world of fairy tales with the Mini Wheels Carriage. This enchanting toy features a beautiful carriage design with intricate details. Pull it along and let your imagination take you on a journey to far-off lands and grand adventures. The Mini Wheels Carriage is perfect for imaginative play and storytelling."
    },
    {
        "Seller": "Harper Davis",
        "ToyName": "Waste Collector",
        "Image": "https://i.ibb.co/KhcMtrP/3.jpg",
        "SubCategory": "Truck",
        "Price": "16.99",
        "AvailableQuantity": 5,
        "Rating": 3.8,
        "Details": "Keep the city clean with the Waste Collector truck. This rugged and realistic toy truck is equipped with a functional waste container, allowing you to collect and transport imaginary trash. Teach the importance of cleanliness and environmental responsibility while having fun with this interactive toy."
    },
    {
        "Seller": "Benjamin Wilson",
        "ToyName": "Power Plower tractor",
        "Image": "https://i.ibb.co/6YYtGzw/2.jpg",
        "SubCategory": "Tractor",
        "Price": "9.99",
        "AvailableQuantity": 10,
        "Rating": 4.3,
        "Details": "Get ready for heavy-duty work with the Power Plower tractor. This robust toy tractor features a realistic design and movable parts, allowing you to plow through imaginary fields and move obstacles out of the way. Whether you're farming or on a construction mission, the Power Plower tractor is up for the task."
    },
    {
        "Seller": "Avery Brown",
        "ToyName": "Tractor Tuff",
        "Image": "https://i.ibb.co/zR4jpxv/1.jpg",
        "SubCategory": "Tractor",
        "Price": "7.99",
        "AvailableQuantity": 6,
        "Rating": 4.7,
        "Details": "Conquer rough terrains with the Rocky Racer Truck. This sturdy and durable toy truck is built to handle all types of surfaces. With its rugged design and powerful wheels, it can navigate through obstacles and climb over rocks with ease. Embark on exciting off-road adventures with the Rocky Racer Truck!"
    },
    {
        "Seller": "Mason Taylor",
        "ToyName": "Mega Monster truck",
        "Image": "https://i.ibb.co/qBpP4yP/4.jpg",
        "SubCategory": "Truck",
        "Price": "29.99",
        "AvailableQuantity": 4,
        "Rating": 3.5,
        "Details": "Transport goods and vehicles with the Transporter Truck. This versatile toy truck features a detachable trailer that can carry other toy cars or construction vehicles. Load up the trailer and embark on exciting transportation missions. With its realistic design and sturdy construction, the Transporter Truck ensures hours of imaginative play."
    },
    {
        "Seller": "Isabella Thompson",
        "ToyName": "Mega Mover",
        "Image": "https://i.ibb.co/QHPx476/5.jpg",
        "SubCategory": "Truck",
        "Price": "14.99",
        "AvailableQuantity": 7,
        "Rating": 4.2,
        "Details": "Conquer any terrain with the Monster Wheels Truck. This rugged and powerful toy truck features oversized wheels and a sturdy frame, allowing it to tackle obstacles and rough surfaces with ease. Whether you're racing, performing stunts, or going on off-road adventures, the Monster Wheels Truck is ready to take on the challenge."
    },
    {
        "Seller": "James Johnson",
        "ToyName": "Turbo Trucker",
        "Image": "https://i.ibb.co/MhKpDXx/1.jpg",
        "SubCategory": "Truck",
        "Price": "24.99",
        "AvailableQuantity": 3,
        "Rating": 4.5,
        "Details": "extreme obstacles with ease using the Turbo Trucker Truck advanced suspension system. It's equipped with powerful shock absorbers that allow for smooth rides and impressive jumps, making it the ultimate off-road companion."
    },
    {
        "Seller": "Harper Davis",
        "ToyName": "Extreme Explorer",
        "Image": "https://i.ibb.co/wChcnxy/2.jpg",
        "SubCategory": "Truck",
        "Price": "16.99",
        "AvailableQuantity": 5,
        "Rating": 3.9,
        "Details": "Truck features realistic sound effects that mimic the roaring engine and rumbling power of a real monster truck. Hear the engine rev, the tires screech, and the crowd cheer as you navigate through rugged terrains."
    }
]